src/cf/DataProcessors/YandexMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>YandexMQ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>_Endpoint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Version</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Region</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_AccessKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_SecretKey</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_SecurityToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/YandexMQ/Ext/ManagerModule.bsl
Функция НовыйКлиентYandexMQ( Знач AccessKey, Знач SecretKey ) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	Объект = Обработки.YandexMQ.Создать();
	Объект._Endpoint  = "https://message-queue.api.cloud.yandex.net/";
	Объект._Version   = "2012-11-05";
	Объект._Region    = "ru-central1";
	Объект._AccessKey = AccessKey;
	Объект._SecretKey = SecretKey;

	Возврат Объект;
	
КонецФункции


Функция НовыйКлиентAmazonSQS( Знач AccessKey, Знач SecretKey, Знач Region = "us-east-1", Знач Version = "2012-11-05" ) Экспорт
	
	УстановитьПривилегированныйРежим( Истина );
	
	Объект = Обработки.YandexMQ.Создать();
	Объект._Endpoint  = "https://sqs." + Region + ".amazonaws.com";
	Объект._Version   = "2012-11-05";
	Объект._Region    = Region;
	Объект._AccessKey = AccessKey;
	Объект._SecretKey = SecretKey;

	Возврат Объект;
	
КонецФункции
